In [93]:
import pandas as pd
import seaborn as sns
data = sns.load_dataset('titanic')

<b>Q1. How do you load a CSV file into a Pandas DataFrame?</b>

We can load CSV file to pandas using read_csv() function imported from pandas library.Mention the path of the file inside the read_csv(). Example code snippet below

import pandas as pd<br>
df = pd.read_csv(r'C:\Users\Ron\Desktop\products_sold.csv')<br>
print(df)

<b>Q2. How do you check the data type of a column in a Pandas DataFrame?</b>

We can get the complete list of data types in a pandas Dataframe using “dtype” attribute. The attribute returns a series with the data type of each column.

In [3]:
data.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

To check the datatype of a particular column use dataframename.columnname.dtypes

In [4]:
data.survived.dtypes

dtype('int64')

<b>Q3. How do you select rows from a Pandas DataFrame based on a condition?</b>

1. Users can select rows based on a particular column value using '>', '==', '<=', '>=', '!=' operators.

In [7]:
data[data.sex=='male']

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

2. Using loc() and iloc() as shown below

In [10]:
data.loc[2] #returns 2nd row in dataset

survived                 1
pclass                   3
sex                 female
age                   26.0
sibsp                    0
parch                    0
fare                 7.925
embarked                 S
class                Third
who                  woman
adult_male           False
deck                   NaN
embark_town    Southampton
alive                  yes
alone                 True
Name: 2, dtype: object

In [9]:
data.iloc[3]  #returns 3rd row in dataset

survived                 1
pclass                   1
sex                 female
age                   35.0
sibsp                    1
parch                    0
fare                  53.1
embarked                 S
class                First
who                  woman
adult_male           False
deck                     C
embark_town    Southampton
alive                  yes
alone                False
Name: 3, dtype: object

<b>Q4. How do you rename columns in a Pandas DataFrame?</b>

Dataframe columns can be renamed by using rename()

In [11]:
data.rename(columns={'sex':'sex_psngr','deck':'deck_psngr'})

,survived,pclass,sex_psngr,age,sibsp,parch,fare,embarked,class,who,adult_male,deck_psngr,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

<b>Q5. How do you drop columns in a Pandas DataFrame?</b>

Using .drop() and set axis=1 which denotes columns

In [17]:
data.drop(['sex','deck'],axis=1)

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,NaN,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

<b>Q6. How do you find the unique values in a column of a Pandas DataFrame?</b>

Using .unique()

In [20]:
data.sex.unique()

array(['male', 'female'], dtype=object)

<b>Q7. How do you find the number of missing values in each column of a Pandas DataFrame?</b>

Using .isna() and sum()

In [21]:
data.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

<b>Q8. How do you fill missing values in a Pandas DataFrame with a specific value?</b>

Use the fillna() Method. The fillna() function iterates through your dataset and fills all empty rows with a specified value. This could be the mean, median, modal, or any other value.

In [25]:
data.age.mean()

29.69911764705882

In [27]:
data.age.fillna(data.age.mean(),inplace=True) #Filling the missing age values with mean of all ages

In [29]:
data.age.isna().sum() # checking if any missing values are pending

0

<b>Q9. How do you concatenate two Pandas DataFrames?</b>

Using concat()

In [50]:
data1 = data.head(5)
data2 = data.tail(5)

In [52]:
pd.concat([data1,data2])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

<b>Q10. How do you merge two Pandas DataFrames on a specific column?</b>

In [55]:
data1 = pd.DataFrame({'Emp':['A','B','C'],'Age':[10,20,30]})

In [56]:
data1

  Emp  Age
0   A   10
1   B   20
2   C   30

In [67]:
data2 = pd.DataFrame({'Emp':['A','B','C'],'Salary':[1000,2000,3000]})

In [66]:
data2

  Emp  Salary
0   A    1000
1   B    2000
2   C    3000

In [68]:
data3 = pd.merge(data1,data2,on='Emp') #Merging on column Emp
data3

  Emp  Age  Salary
0   A   10    1000
1   B   20    2000
2   C   30    3000

<b>Q11. How do you group data in a Pandas DataFrame by a specific column and apply an aggregation function?</b>

Using groupby()

In [63]:
data.groupby('sex').fare.sum()  #lists total fare by Sex

sex
female    13966.6628
male      14727.2865
Name: fare, dtype: float64

<b>Q12. How do you pivot a Pandas DataFrame?</b>

The pivot() function is used to reshaped a given DataFrame organized by given index / column values.

In [69]:
data3.pivot(index='Emp',columns='Age',values='Salary')

Age      10      20      30
Emp
A    1000.0     NaN     NaN
B       NaN  2000.0     NaN
C       NaN     NaN  3000.0

<b>Q13. How do you change the data type of a column in a Pandas DataFrame?</b>

Using astype()

Following is the syntax of astype() method.

astype(dtype, copy=True, errors='raise', **kwargs)

<b>Q14. How do you sort a Pandas DataFrame by a specific column?</b>

Using sort_values(). Syntax of the same is shown below

sorted_df = df.sort_values(by=['Column_name'], ascending=True)

<b>Q15. How do you create a copy of a Pandas DataFrame?</b>

The copy() method returns a copy of the DataFrame. By default, the copy is a "deep copy" meaning that any changes made in the original DataFrame will NOT be reflected in the copy.By default (deep=True, any changes made in the original DataFrame will NOT be reflected in the copy.

With the parameter deep=False, it is only the reference to the data (and index) that will be copied, and any changes made in the original will be reflected in the copy, and, any changes made in the copy will be reflected in the original.

dataframe.copy(deep)

<b>Q16. How do you filter rows of a Pandas DataFrame by multiple conditions?</b>

Pandas dataframes allow for boolean indexing which is quite an efficient way to filter a dataframe for multiple conditions. In boolean indexing, boolean vectors generated based on the conditions are used to filter the data. Multiple conditions involving the operators | (for or operation), & (for and operation), and ~ (for not operation) can be grouped using parenthesis ().

<b>Q17. How do you calculate the mean of a column in a Pandas DataFrame?</b>

Using mean() as shown below

In [73]:
data3.Salary.mean()   #calculates mean of Salary columns

2000.0

<b>Q18. How do you calculate the standard deviation of a column in a Pandas DataFrame?</b>

In [76]:
data.fare.std() #calculates the standard deviation of fare columns

49.693428597180905

<b>Q19. How do you calculate the correlation between two columns in a Pandas DataFrame?</b>

By using corr() function we can get the correlation between two columns in the dataframe

In [77]:
data.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [79]:
data['parch'].corr(data['fare'])

0.21622494477076476

<b>Q20. How do you select specific columns in a DataFrame using their labels?</b>

In [82]:
data3[['Emp','Salary']]

  Emp  Salary
0   A    1000
1   B    2000
2   C    3000

In [85]:
data3.loc[:,['Emp','Salary']]

  Emp  Salary
0   A    1000
1   B    2000
2   C    3000

In [86]:
data3.iloc[:,[1,2]]

   Age  Salary
0   10    1000
1   20    2000
2   30    3000

<b>Q21. How do you select specific rows in a DataFrame using their indexes?</b>

You can select a single row from pandas DataFrame by integer index using df. iloc[n] . Replace n with a position you wanted to select.

<b>Q22. How do you sort a DataFrame by a specific column?</b>

To sort the DataFrame based on the values in a single column, you'll use . sort_values() . By default, this will return a new DataFrame sorted in ascending order. It does not modify the original DataFrame.

<b>Q23. How do you create a new column in a DataFrame based on the values of another column?</b>

Using apply()

In [94]:
def percent(x):

    return (x / 1) * 100

data['%_survival_rate'] = data.survived.apply(percent)

data

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,%_survival_rate
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,0.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,100.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,100.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,100.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,0.0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,100.0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,0.0
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,100.0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,0.0

<b>Q24. How do you remove duplicates from a DataFrame?</b>

The drop_duplicates() method removes duplicate rows.

Use the subset parameter if only some specified columns should be considered when looking for duplicates.

Syntax: <br>dataframe.drop_duplicates(subset, keep, inplace, ignore_index)

<b>Q25. What is the difference between .loc and .iloc in Pandas?</b>

loc is label-based, which means that you have to specify rows and columns based on their row and column labels. iloc is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position)